; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob3) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate5)
	(at pallet1 depot1)
	(clear crate1)
	(at pallet2 depot2)
	(clear crate7)
	(at pallet3 distributor0)
	(clear crate11)
	(at pallet4 distributor1)
	(clear crate12)
	(at pallet5 distributor2)
	(clear crate8)
	(at pallet6 depot1)
	(clear pallet6)
	(at pallet7 distributor1)
	(clear crate6)
	(at truck0 depot1)
	(at truck1 depot1)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 distributor0)
	(available hoist6)
	(at hoist7 depot1)
	(available hoist7)
	(at hoist8 depot0)
	(available hoist8)
	(at hoist9 depot0)
	(available hoist9)
	(at crate0 depot1)
	(on crate0 pallet1)
	(at crate1 depot1)
	(on crate1 crate0)
	(at crate2 distributor1)
	(on crate2 pallet7)
	(at crate3 distributor0)
	(on crate3 pallet3)
	(at crate4 distributor2)
	(on crate4 pallet5)
	(at crate5 depot0)
	(on crate5 pallet0)
	(at crate6 distributor1)
	(on crate6 crate2)
	(at crate7 depot2)
	(on crate7 pallet2)
	(at crate8 distributor2)
	(on crate8 crate4)
	(at crate9 distributor1)
	(on crate9 pallet4)
	(at crate10 distributor1)
	(on crate10 crate9)
	(at crate11 distributor0)
	(on crate11 crate3)
	(at crate12 distributor1)
	(on crate12 crate10)
)

(:goal (and
		(on crate0 pallet5)
		(on crate1 crate9)
		(on crate4 pallet7)
		(on crate5 crate10)
		(on crate7 pallet6)
		(on crate8 crate7)
		(on crate9 crate5)
		(on crate10 crate11)
		(on crate11 pallet1)
		(on crate12 pallet2)
	)
))

; plan
1. (drive truck1 depot1 depot0)
   deleted: (at truck1 depot1)
   added: (at truck1 depot0)
   goals met: 0 of 10
2. (lift hoist1 crate1 crate0 depot1)
   deleted: (at crate1 depot1) (clear crate1) (available hoist1) (on crate1 crate0)
   added: (lifting hoist1 crate1) (clear crate0)
   goals met: 0 of 10
3. (load hoist1 crate1 truck0 depot1)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck0) (available hoist1)
   goals met: 0 of 10
4. (drive truck0 depot1 distributor1)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor1)
   goals met: 0 of 10
5. (lift hoist7 crate0 pallet1 depot1)
   deleted: (at crate0 depot1) (clear crate0) (available hoist7) (on crate0 pallet1)
   added: (lifting hoist7 crate0) (clear pallet1)
   goals met: 0 of 10
6. (lift hoist9 crate5 pallet0 depot0)
   deleted: (at crate5 depot0) (clear crate5) (available hoist9) (on crate5 pallet0)
   added: (lifting hoist9 crate5) (clear pallet0)
   goals met: 0 of 10
7. (load hoist9 crate5 truck1 depot0)
   deleted: (lifting hoist9 crate5)
   added: (in crate5 truck1) (available hoist9)
   goals met: 0 of 10
8. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   goals met: 0 of 10
9. (drive truck0 distributor1 depot1)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot1)
   goals met: 0 of 10
10. (load hoist7 crate0 truck0 depot1)
   deleted: (lifting hoist7 crate0)
   added: (in crate0 truck0) (available hoist7)
   goals met: 0 of 10
11. (drive truck0 depot1 distributor1)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor1)
   goals met: 0 of 10
12. (drive truck0 distributor1 distributor2)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor2)
   goals met: 0 of 10
13. (lift hoist5 crate8 crate4 distributor2)
   deleted: (at crate8 distributor2) (clear crate8) (available hoist5) (on crate8 crate4)
   added: (lifting hoist5 crate8) (clear crate4)
   goals met: 0 of 10
14. (load hoist5 crate8 truck0 distributor2)
   deleted: (lifting hoist5 crate8)
   added: (in crate8 truck0) (available hoist5)
   goals met: 0 of 10
15. (lift hoist5 crate4 pallet5 distributor2)
   deleted: (at crate4 distributor2) (clear crate4) (available hoist5) (on crate4 pallet5)
   added: (lifting hoist5 crate4) (clear pallet5)
   goals met: 0 of 10
16. (load hoist5 crate4 truck0 distributor2)
   deleted: (lifting hoist5 crate4)
   added: (in crate4 truck0) (available hoist5)
   goals met: 0 of 10
17. (unload hoist5 crate0 truck0 distributor2)
   deleted: (in crate0 truck0) (available hoist5)
   added: (lifting hoist5 crate0)
   goals met: 0 of 10
18. (drive truck0 distributor2 depot2)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot2)
   goals met: 0 of 10
19. (drop hoist5 crate0 pallet5 distributor2)
   deleted: (lifting hoist5 crate0) (clear pallet5)
   added: (available hoist5) (at crate0 distributor2) (clear crate0) (on crate0 pallet5)
   goals met: 1 of 10
20. (unload hoist2 crate8 truck0 depot2)
   deleted: (in crate8 truck0) (available hoist2)
   added: (lifting hoist2 crate8)
   goals met: 1 of 10
21. (drive truck0 depot2 distributor1)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor1)
   goals met: 1 of 10
22. (drop hoist2 crate8 crate7 depot2)
   deleted: (lifting hoist2 crate8) (clear crate7)
   added: (available hoist2) (at crate8 depot2) (clear crate8) (on crate8 crate7)
   goals met: 2 of 10
23. (lift hoist6 crate11 crate3 distributor0)
   deleted: (at crate11 distributor0) (clear crate11) (available hoist6) (on crate11 crate3)
   added: (lifting hoist6 crate11) (clear crate3)
   goals met: 2 of 10
24. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   goals met: 2 of 10
25. (load hoist6 crate11 truck0 distributor0)
   deleted: (lifting hoist6 crate11)
   added: (in crate11 truck0) (available hoist6)
   goals met: 2 of 10
26. (drive truck0 distributor0 depot1)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot1)
   goals met: 2 of 10
27. (unload hoist7 crate11 truck0 depot1)
   deleted: (in crate11 truck0) (available hoist7)
   added: (lifting hoist7 crate11)
   goals met: 2 of 10
28. (drive truck0 depot1 distributor1)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor1)
   goals met: 2 of 10
29. (drop hoist7 crate11 pallet1 depot1)
   deleted: (lifting hoist7 crate11) (clear pallet1)
   added: (available hoist7) (at crate11 depot1) (clear crate11) (on crate11 pallet1)
   goals met: 3 of 10
30. (lift hoist4 crate12 crate10 distributor1)
   deleted: (at crate12 distributor1) (clear crate12) (available hoist4) (on crate12 crate10)
   added: (lifting hoist4 crate12) (clear crate10)
   goals met: 3 of 10
31. (load hoist4 crate12 truck0 distributor1)
   deleted: (lifting hoist4 crate12)
   added: (in crate12 truck0) (available hoist4)
   goals met: 3 of 10
32. (drive truck0 distributor1 depot2)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot2)
   goals met: 3 of 10
33. (lift hoist2 crate8 crate7 depot2)
   deleted: (at crate8 depot2) (clear crate8) (available hoist2) (on crate8 crate7)
   added: (lifting hoist2 crate8) (clear crate7)
   goals met: 2 of 10
34. (load hoist2 crate8 truck0 depot2)
   deleted: (lifting hoist2 crate8)
   added: (in crate8 truck0) (available hoist2)
   goals met: 2 of 10
35. (lift hoist2 crate7 pallet2 depot2)
   deleted: (at crate7 depot2) (clear crate7) (available hoist2) (on crate7 pallet2)
   added: (lifting hoist2 crate7) (clear pallet2)
   goals met: 2 of 10
36. (load hoist2 crate7 truck0 depot2)
   deleted: (lifting hoist2 crate7)
   added: (in crate7 truck0) (available hoist2)
   goals met: 2 of 10
37. (drive truck0 depot2 depot1)
   deleted: (at truck0 depot2)
   added: (at truck0 depot1)
   goals met: 2 of 10
38. (unload hoist7 crate7 truck0 depot1)
   deleted: (in crate7 truck0) (available hoist7)
   added: (lifting hoist7 crate7)
   goals met: 2 of 10
39. (drive truck0 depot1 distributor1)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor1)
   goals met: 2 of 10
40. (drop hoist7 crate7 pallet6 depot1)
   deleted: (lifting hoist7 crate7) (clear pallet6)
   added: (available hoist7) (at crate7 depot1) (clear crate7) (on crate7 pallet6)
   goals met: 3 of 10
41. (drive truck0 distributor1 depot1)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot1)
   goals met: 3 of 10
42. (unload hoist7 crate8 truck0 depot1)
   deleted: (in crate8 truck0) (available hoist7)
   added: (lifting hoist7 crate8)
   goals met: 3 of 10
43. (drive truck0 depot1 depot2)
   deleted: (at truck0 depot1)
   added: (at truck0 depot2)
   goals met: 3 of 10
44. (drive truck0 depot2 distributor1)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor1)
   goals met: 3 of 10
45. (drop hoist7 crate8 crate7 depot1)
   deleted: (lifting hoist7 crate8) (clear crate7)
   added: (available hoist7) (at crate8 depot1) (clear crate8) (on crate8 crate7)
   goals met: 4 of 10
46. (drive truck0 distributor1 depot2)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot2)
   goals met: 4 of 10
47. (unload hoist2 crate12 truck0 depot2)
   deleted: (in crate12 truck0) (available hoist2)
   added: (lifting hoist2 crate12)
   goals met: 4 of 10
48. (drive truck0 depot2 distributor1)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor1)
   goals met: 4 of 10
49. (drop hoist2 crate12 pallet2 depot2)
   deleted: (lifting hoist2 crate12) (clear pallet2)
   added: (available hoist2) (at crate12 depot2) (clear crate12) (on crate12 pallet2)
   goals met: 5 of 10
50. (lift hoist4 crate10 crate9 distributor1)
   deleted: (at crate10 distributor1) (clear crate10) (available hoist4) (on crate10 crate9)
   added: (lifting hoist4 crate10) (clear crate9)
   goals met: 5 of 10
51. (load hoist4 crate10 truck1 distributor1)
   deleted: (lifting hoist4 crate10)
   added: (in crate10 truck1) (available hoist4)
   goals met: 5 of 10
52. (drive truck1 distributor1 depot1)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot1)
   goals met: 5 of 10
53. (unload hoist7 crate10 truck1 depot1)
   deleted: (in crate10 truck1) (available hoist7)
   added: (lifting hoist7 crate10)
   goals met: 5 of 10
54. (unload hoist1 crate5 truck1 depot1)
   deleted: (in crate5 truck1) (available hoist1)
   added: (lifting hoist1 crate5)
   goals met: 5 of 10
55. (drop hoist7 crate10 crate11 depot1)
   deleted: (lifting hoist7 crate10) (clear crate11)
   added: (available hoist7) (at crate10 depot1) (clear crate10) (on crate10 crate11)
   goals met: 6 of 10
56. (drop hoist1 crate5 crate10 depot1)
   deleted: (lifting hoist1 crate5) (clear crate10)
   added: (available hoist1) (at crate5 depot1) (clear crate5) (on crate5 crate10)
   goals met: 7 of 10
57. (lift hoist4 crate9 pallet4 distributor1)
   deleted: (at crate9 distributor1) (clear crate9) (available hoist4) (on crate9 pallet4)
   added: (lifting hoist4 crate9) (clear pallet4)
   goals met: 7 of 10
58. (load hoist4 crate9 truck0 distributor1)
   deleted: (lifting hoist4 crate9)
   added: (in crate9 truck0) (available hoist4)
   goals met: 7 of 10
59. (drive truck0 distributor1 depot1)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot1)
   goals met: 7 of 10
60. (unload hoist7 crate1 truck0 depot1)
   deleted: (in crate1 truck0) (available hoist7)
   added: (lifting hoist7 crate1)
   goals met: 7 of 10
61. (unload hoist1 crate9 truck0 depot1)
   deleted: (in crate9 truck0) (available hoist1)
   added: (lifting hoist1 crate9)
   goals met: 7 of 10
62. (drive truck0 depot1 distributor1)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor1)
   goals met: 7 of 10
63. (drop hoist1 crate9 crate5 depot1)
   deleted: (lifting hoist1 crate9) (clear crate5)
   added: (available hoist1) (at crate9 depot1) (clear crate9) (on crate9 crate5)
   goals met: 8 of 10
64. (drop hoist7 crate1 crate9 depot1)
   deleted: (lifting hoist7 crate1) (clear crate9)
   added: (available hoist7) (at crate1 depot1) (clear crate1) (on crate1 crate9)
   goals met: 9 of 10
65. (lift hoist4 crate6 crate2 distributor1)
   deleted: (at crate6 distributor1) (clear crate6) (available hoist4) (on crate6 crate2)
   added: (lifting hoist4 crate6) (clear crate2)
   goals met: 9 of 10
66. (load hoist4 crate6 truck0 distributor1)
   deleted: (lifting hoist4 crate6)
   added: (in crate6 truck0) (available hoist4)
   goals met: 9 of 10
67. (lift hoist4 crate2 pallet7 distributor1)
   deleted: (at crate2 distributor1) (clear crate2) (available hoist4) (on crate2 pallet7)
   added: (lifting hoist4 crate2) (clear pallet7)
   goals met: 9 of 10
68. (load hoist4 crate2 truck0 distributor1)
   deleted: (lifting hoist4 crate2)
   added: (in crate2 truck0) (available hoist4)
   goals met: 9 of 10
69. (unload hoist4 crate4 truck0 distributor1)
   deleted: (in crate4 truck0) (available hoist4)
   added: (lifting hoist4 crate4)
   goals met: 9 of 10
70. (drop hoist4 crate4 pallet7 distributor1)
   deleted: (lifting hoist4 crate4) (clear pallet7)
   added: (available hoist4) (at crate4 distributor1) (clear crate4) (on crate4 pallet7)
   goals met: 10 of 10
